---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteT.CantileverLength
source: html/e3df545b-9e1d-7521-6b54-8b5b4b8cce43.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteT.CantileverLength Property

Flange cantilever length.

## Syntax (C#)
```csharp
public double CantileverLength { get; set; }
```